In [19]:
!pip install psycopg2-binary

import pandas as pd

Requirement already satisfied: psycopg2-binary in /opt/anaconda3/lib/python3.13/site-packages (2.9.11)

In [20]:
import pandas as pd
import psycopg2

In [21]:
# Step 2: Connect to the Database
import psycopg2
conn = psycopg2.connect(
    dbname="neondb",
    user="neondb_owner",
    password="a9Am7Yy5r9_T7h4OF2GN",
    host="ep-falling-glitter-a5m0j5gk-pooler.us-east-2.aws.neon.tech",
    port="5432",
    sslmode="require"
)
cur = conn.cursor() 
print("âœ… Connection successful!")

âœ… Connection successful!

In [22]:
# Step 4: Count schools by borough
query = """
SELECT borough, COUNT(DISTINCT dbn) AS school_count
FROM nyc_schools.high_school_directory
GROUP BY borough
ORDER BY school_count DESC;
"""
df_distribution = pd.read_sql(query, conn)
df_distribution
# Step 3: Run a Test Query
query = "SELECT * FROM nyc_schools.high_school_directory LIMIT 5;"
df = pd.read_sql(query, conn)
df.head() 
print("âœ… Counting unique dbn values per borough")

/var/folders/mn/w43_rvg92n9dv58q76z80hgc0000gn/T/ipykernel_3472/1570090324.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_distribution = pd.read_sql(query, conn)
/var/folders/mn/w43_rvg92n9dv58q76z80hgc0000gn/T/ipykernel_3472/1570090324.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

âœ… Counting unique dbn values per borough

In [17]:
# Step 5 : Average ELL% per borough
query = """
SELECT d.borough, 
       ROUND(AVG(s.ell_percent)::numeric, 2) AS avg_ell_percent
FROM nyc_schools.school_demographics AS s
JOIN nyc_schools.high_school_directory AS d
ON s.dbn = d.dbn
GROUP BY d.borough
ORDER BY avg_ell_percent DESC;
"""

df_ell = pd.read_sql(query, conn)
df_ell['avg_ell_percent'] = df_ell['avg_ell_percent'].round(2)
df_ell

/var/folders/mn/w43_rvg92n9dv58q76z80hgc0000gn/T/ipykernel_3472/3381717455.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_ell = pd.read_sql(query, conn)

     borough  avg_ell_percent
0  Manhattan             7.57

In [55]:
query = "SELECT DISTINCT borough FROM nyc_schools.high_school_directory;"
df_boroughs = pd.read_sql(query, conn)
df_boroughs

/var/folders/mn/w43_rvg92n9dv58q76z80hgc0000gn/T/ipykernel_16947/2892404296.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_boroughs = pd.read_sql(query, conn)

         borough
0       Brooklyn
1         Queens
2  Staten Island
3      Manhattan
4          Bronx

In [56]:
query = "SELECT DISTINCT dbn FROM nyc_schools.school_demographics;"
df_dbns = pd.read_sql(query, conn)
len(df_dbns)

/var/folders/mn/w43_rvg92n9dv58q76z80hgc0000gn/T/ipykernel_16947/538210552.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_dbns = pd.read_sql(query, conn)

32

In [57]:
query = """
SELECT d.borough, ROUND(AVG(s.ell_percent)) AS avg_ell_percent
FROM nyc_schools.high_school_directory AS d
LEFT JOIN nyc_schools.school_demographics AS s
ON s.dbn = d.dbn
GROUP BY d.borough
ORDER BY avg_ell_percent DESC;
"""
df_ell = pd.read_sql(query, conn)
df_ell

/var/folders/mn/w43_rvg92n9dv58q76z80hgc0000gn/T/ipykernel_16947/2381284048.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_ell = pd.read_sql(query, conn)

         borough  avg_ell_percent
0       Brooklyn              NaN
1         Queens              NaN
2  Staten Island              NaN
3          Bronx              NaN
4      Manhattan              8.0

In [19]:
query = "SELECT * FROM nyc_schools.school_safety_report LIMIT 5;"
df_check = pd.read_sql(query, conn)
df_check.columns

/var/folders/mn/w43_rvg92n9dv58q76z80hgc0000gn/T/ipykernel_16947/614300381.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_check = pd.read_sql(query, conn)

Index(['school_year', 'building_code', 'dbn', 'location_name', 'location_code',
       'address', 'borough', 'geographical_district_code', 'register',
       'building_name', 'num_schools', 'schools_in_building', 'major_n',
       'oth_n', 'nocrim_n', 'prop_n', 'vio_n', 'engroupa', 'rangea',
       'avgofmajor_n', 'avgofoth_n', 'avgofnocrim_n', 'avgofprop_n',
       'avgofvio_n', 'borough_name', 'postcode', 'latitude', 'longitude',
       'community_board', 'council_district', 'census_tract', 'bin', 'bbl',
       'nta', '_schools'],
      dtype='object')

In [21]:
list(df_check.columns)

['school_year',
 'building_code',
 'dbn',
 'location_name',
 'location_code',
 'address',
 'borough',
 'geographical_district_code',
 'register',
 'building_name',
 'num_schools',
 'schools_in_building',
 'major_n',
 'oth_n',
 'nocrim_n',
 'prop_n',
 'vio_n',
 'engroupa',
 'rangea',
 'avgofmajor_n',
 'avgofoth_n',
 'avgofnocrim_n',
 'avgofprop_n',
 'avgofvio_n',
 'borough_name',
 'postcode',
 'latitude',
 'longitude',
 'community_board',
 'council_district',
 'census_tract',
 'bin',
 'bbl',
 'nta',
 '_schools']

In [58]:
df_check.head(3)

,school_year,building_code,dbn,location_name,location_code,address,borough,geographical_district_code,register,building_name,...,postcode,latitude,longitude,community_board,council_district,census_tract,bin,bbl,nta,_schools
0,2015-16,K006,17K006,P.S. 006,K006,43 SNYDER AVENUE,K,17.0,712,,...,11226.0,40.65,-73.96,14.0,40.0,794.0,3.12e+06,3.05e+09,Erasmus ...,1
1,2015-16,K005,16K005,P.S. 005 Dr. Ronald Mcnair,K005,820 HANCOCK STREET,K,16.0,231,,...,11233.0,40.69,-73.92,3.0,41.0,377.0,3.04e+06,3.01e+09,Stuyvesant Heights ...,1
2,2015-16,K003,13K003,P.S. 003 The Bedford Village,K003,50 JEFFERSON AVENUE,K,13.0,450,,...,11216.0,40.68,-73.96,3.0,36.0,227.0,3.06e+06,3.02e+09,Clinton Hill ...,1

In [59]:
[col for col in df_check.columns if "major" in col.lower()]

['major_n', 'avgofmajor_n']

In [60]:
# Step 6 (Final) :
query = """
SELECT d.borough,
       AVG(s.avgofmajor_n) AS avg_major_incidents
FROM nyc_schools.school_safety_report AS s
JOIN nyc_schools.high_school_directory AS d
ON s.dbn = d.dbn
GROUP BY d.borough
ORDER BY avg_major_incidents DESC;
"""

df_safety = pd.read_sql(query, conn)
df_safety

/var/folders/mn/w43_rvg92n9dv58q76z80hgc0000gn/T/ipykernel_16947/44751524.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_safety = pd.read_sql(query, conn)

         borough  avg_major_incidents
0  Staten Island                 1.01
1         Queens                 0.89
2       Brooklyn                 0.69
3      Manhattan                 0.54
4          Bronx                 0.48

In [61]:
query = "SELECT table_name FROM information_schema.tables WHERE table_schema='public';"
pd.read_sql(query, conn)

/var/folders/mn/w43_rvg92n9dv58q76z80hgc0000gn/T/ipykernel_16947/3396966052.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, conn)

                        table_name
0                   mytable_martin
1                            users
2                      sat_results
3                       sat_scores
4                      departments
5        hospitals_refactored_test
6                          mytable
7                   hourly_metrics
8                geography_columns
9                 geometry_columns
10                 spatial_ref_sys
11  dependency_example.departments
12            ucheokoli_sat_scores
13       martin_svitek_sat_results
14                immowelt_ci_runs
15   serhii_sotnichenko_sat_scores
16             cleaned_sat_results
17                   users_staging
18      isabella_leach_sat_results
19                berlin_dog_parks
20                      demo_users
21  sebastian-bangemann_sat_scores
22  test_berlin_data.test_df_table
23                      pharmacies
24           neighborhood_segments
25  test_berlin_data.products_test
26                 pharmacies_test
27       test_schema.users_df_test
28          supermarkets_in_berlin
29            alexandra_sat_scores
30            malls_in_berlin_test
31                 malls_in_berlin
32                  untitled_table

In [23]:
# Step 7: Top 3 Special Needs Schools per Borough

query_demo = "SELECT dbn, sped_percent FROM nyc_schools.school_demographics;"
df_demo = pd.read_sql(query_demo, conn)

query_dir = "SELECT dbn, school_name, borough FROM nyc_schools.high_school_directory;"
df_dir = pd.read_sql(query_dir, conn)

df_merged = pd.merge(df_dir, df_demo, on="dbn", how="inner")

df_merged['sped_percent'] = pd.to_numeric(df_merged['sped_percent'], errors='coerce')


df_top3 = (df_merged
           .sort_values(['borough', 'sped_percent'], ascending=[True, False])
           .groupby('borough')
           .head(3)
           .reset_index(drop=True))


df_top3['sped_percent'] = df_top3['sped_percent'].round(2)

df_top3

/var/folders/mn/w43_rvg92n9dv58q76z80hgc0000gn/T/ipykernel_3472/4278492528.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_demo = pd.read_sql(query_demo, conn)
/var/folders/mn/w43_rvg92n9dv58q76z80hgc0000gn/T/ipykernel_3472/4278492528.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_dir = pd.read_sql(query_dir, conn)

      dbn                 school_name    borough  sped_percent
0  01M450  East Side Community School  Manhattan          28.8
1  01M450  East Side Community School  Manhattan          27.7
2  01M450  East Side Community School  Manhattan          26.7

In [8]:
# ==== FINAL RESULTS SUMMARY ====
import pandas as pd
from IPython.display import display

pd.set_option("display.max_rows", 100)
pd.set_option("display.precision", 2)

print("âœ… Final Results Summary")

# Schools per Borough
print("\nâ€” Schools per Borough â€”")
try:
    display(df_schools)
except NameError:
    print("df_schools not found. (Run the schools-per-borough cell.)")

# Average ELL% per Borough
print("\nâ€” Average ELL% per Borough â€”")
try:
    display(df_ell_nulls)
except NameError:
    print("df_ell_nulls not found. (Run the ELL cell with LEFT JOIN.)")

# Average Major Incidents per Borough
print("\nâ€” Average Major Incidents per Borough â€”")
try:
    display(df_safety)
except NameError:
    print("df_safety not found. (Run the safety/major incidents cell.)")

âœ… Final Results Summary

â€” Schools per Borough â€”
df_schools not found. (Run the schools-per-borough cell.)

â€” Average ELL% per Borough â€”
df_ell_nulls not found. (Run the ELL cell with LEFT JOIN.)

â€” Average Major Incidents per Borough â€”
df_safety not found. (Run the safety/major incidents cell.)

 ðŸ“˜ Notes on Data Availability
1- The ELL (English Language Learner) data is only available for Manhattan in the current dataset.
2- Other boroughs show NULL values because their demographic records are missing.
3- This indicates a data gap rather than an error in the queries or the notebook.
 Additional Note:
The dataset used in this analysis has limited data availability for some boroughs.  
For example, ELL and sped_percent values are only available for Manhattan, while other boroughs show NULL due to missing demographic information.  
This does not indicate an error in the queries â€” it reflects a data limitation in the source dataset.